blueskycoco/rtt/bsp/tm4c129x/applications/con_common.c
		}
		break;
		case 8:
		case 9:
		case 10:
		case 11:
		{
			//set remote ipv4 ip
			if((data[0]-8)==dev)
			{
				rt_uint8_t *tmp=rt_malloc(16);
				rt_memset(tmp,'\0',16);
				rt_sprintf(tmp,"%d.%d.%d.%d",data[1],data[2],data[3],data[4]);
				if(memcmp(tmp,g_conf.remote_ip[data[0]-8],16)!=0)
				{
					rt_memset(g_conf.remote_ip[data[0]-8],'\0',16);
					rt_sprintf(g_conf.remote_ip[data[0]-8],"%d.%d.%d.%d",data[1],data[2],data[3],data[4]);
					g_chang[dev].rip4c=1;
				}
				rt_free(tmp);
			}
		}
		break;
		case 12:
		case 13:			
		case 14:
		case 15:
		{
			//set remote ipv6 ip
			if((data[0]-12)==dev)
			{
				rt_uint8_t *tmp=rt_malloc(ipv6_len);
				rt_memset(tmp,'\0',ipv6_len);
				for(i=0;i<ipv6_len;i++)
					tmp[i]=data[i+1];
				if(memcmp(tmp,g_conf.remote_ip6[data[0]-12],ipv6_len)!=0 || ipv6_len!=rt_strlen(g_conf.remote_ip6[data[0]-12]))
				{
					rt_memset(g_conf.remote_ip6[data[0]-12],'\0',64);
					for(i=0;i<ipv6_len;i++)
						g_conf.remote_ip6[data[0]-12][i]=data[i+1];
					g_chang[dev].rip6c=1;
				}
				rt_free(tmp);
			}
		}
		break;
		case 16:
		case 17:
		case 18:
		case 19:
		{
			//set remote port
			if((data[0]-16)==dev)
			{
				if(g_conf.remote_port[data[0]-16]!=(data[1]<<8|data[2]))
				{
					g_conf.remote_port[data[0]-16]=(data[1]<<8|data[2]);
					g_chang[dev].rpc=1;
				}
			}
		}
		break;
		case 20:
		case 21:
		case 22:
		case 23:
		{
			//set net protol ipv4 or ipv6
			if((data[0]-20)==dev)
			{
				if(data[1])
				{	
					if((g_conf.config[data[0]-20]&CONFIG_IPV6)!=CONFIG_IPV6)
					{
						g_conf.config[data[0]-20]|=CONFIG_IPV6;
						g_chang[dev].protol=1;
					}
				}
				else
				{
					if((g_conf.config[data[0]-20]&CONFIG_IPV6)==CONFIG_IPV6)
					{
						g_conf.config[data[0]-20]&=~CONFIG_IPV6;
						g_chang[dev].protol=1;
					}
				}
			}
		}
		break;
		case 24:
		case 25:
		case 26:
		case 27:
		{
			//set server or client mode
			if((data[0]-24)==dev)
			{
				if(data[1])
				{
					if((g_conf.config[data[0]-24]&CONFIG_SERVER)!=CONFIG_SERVER)
					{
						g_conf.config[data[0]-24]|=CONFIG_SERVER;
						g_chang[dev].cs=1;
					}
				}
				else
				{
					if((g_conf.config[data[0]-24]&CONFIG_SERVER)==CONFIG_SERVER)
					{
						g_conf.config[data[0]-24]&=~CONFIG_SERVER;
						g_chang[dev].cs=1;
					}
				}
			}
		}
		break;
		case 28:
		case 29:
		case 30:
		case 31:
		{
			//set uart baud
			if((data[0]-28)==dev)
			{
				g_conf.config[data[0]-28]=((g_conf.config[data[0]-20]&0x07)|(data[1]<<3));
			}
		}
		break;
		case 32:
		{
			//set local ipv6 ip
			rt_uint8_t *tmp=rt_malloc(ipv6_len);
			rt_memset(tmp,'\0',ipv6_len);
			for(i=0;i<ipv6_len;i++)
				tmp[i]=data[i+1];
			if(memcmp(tmp,g_conf.local_ip6,ipv6_len)!=0 || ipv6_len!=rt_strlen(g_conf.local_ip6))
			{
				ipv6_changed=true;
				rt_memset(g_conf.local_ip6,'\0',64);
				for(i=0;i<ipv6_len;i++)
					g_conf.local_ip6[i]=data[i+1];
				g_chang[dev].lip6c=1;
			}
			rt_free(tmp);
		}
		break;
		case 33:
		case 34:
		case 35:
		case 36:
		{//set tcp or udp
			if((data[0]-33)==dev)
			{
				if(data[1])
				{
					if((g_conf.config[data[0]-33]&CONFIG_TCP)!=CONFIG_TCP)
					{
						g_conf.config[data[0]-33]|=CONFIG_TCP;
						g_chang[dev].mode=1;
					}
				}
				else
				{
					if((g_conf.config[data[0]-33]&CONFIG_TCP)==CONFIG_TCP)
					{					
						g_conf.config[data[0]-33]&=~CONFIG_TCP;
						g_chang[dev].mode=1;
					}
				}
			}
		}
		break;
		default:
			rt_kprintf("wrong cmd\n");
	}
	if(ipv4_changed)
		set_if("e0",g_conf.local_ip,g_conf.gw,g_conf.sub_msk);
	if(ipv6_changed)
		set_if6("e0",g_conf.local_ip6);
}
bool need_reconfig(int dev)
{
	if(g_chang[dev].cs||g_chang[dev].lip6c||g_chang[dev].lpc||g_chang[dev].mode||
	   g_chang[dev].protol||g_chang[dev].rip4c||g_chang[dev].rip6c||g_chang[dev].rpc)
	{
		if(g_chang[dev].cs)
			rt_kprintf("%d client/server changed\n",dev);
		if(g_chang[dev].lip6c)
			rt_kprintf("%d local ip6 changed\n",dev);
		if(g_chang[dev].lpc)
			rt_kprintf("%d local port changed\n",dev);
		if(g_chang[dev].mode)
			rt_kprintf("%d tcp/udp changed\n",dev);
		if(g_chang[dev].protol)
			rt_kprintf("%d ipv4/ipv6 changed\n",dev);
		if(g_chang[dev].rip4c)
			rt_kprintf("%d remote ip4 changed\n",dev);
		if(g_chang[dev].rip6c)
			rt_kprintf("%d remote ip6 changed\n",dev);
		if(g_chang[dev].rpc)
			rt_kprintf("%d remote port changed\n",dev);
		rt_uint8_t *ptr=(rt_uint8_t *)(&g_chang[dev]);
		rt_memset(ptr,0,sizeof(change));
		return true;
	}
	else
		return false;
	
}
void common_rw_config(int dev)
{

	static rt_uint8_t buf[65];
	rt_uint8_t i=0;	
	static int data_len,crc_len,longlen=0;
	static unsigned char crc[2];
	char ch;	
	static rt_uint8_t len=0,param;
	static enum STATE_OP state=GET_F5;
	DBG("enter common_rw_config\r\n");
	rt_uint8_t *ptr=(rt_uint8_t *)buf;
	rt_thread_delay(10);
	while((rt_device_read(common_dev[dev], 0, &ch, 1) == 1))
	{
		if(ch==0xf5 && state==GET_F5)
		{
			DBG("GET_F5\n");
			state=GET_8A_8B;
		}
		else if(ch==0x8a && state==GET_8A_8B)
		{
			DBG("GET_8A\n");
			data_len=0;
			longlen=0;
			state=GET_DATA;
		}
		else if(ch==0x8b && state==GET_8A_8B)
		{
			DBG("GET_8B\n");
			break;
		}
		else if(state==GET_DATA)
		{	
			DBG("GET_DATA %2x\n",ch);
			*(ptr+data_len)=ch;
			if(data_len==0)
			{
				if(ch==0x0c || ch==0x0d || ch==0x0e || ch==0x0f || ch==0x20)
					state=GET_LEN;
 			}
			else
			{
				if(ch==0x26&&(data_len>longlen))
					state=GET_FA;
 			}
			
			data_len++;
		}
		else if(state==GET_LEN)
		{
			DBG("GET_LEN %2x\n",ch);
			longlen=ch;
			state=GET_DATA;
		}
		else if(ch==0xfa && state==GET_FA)
		{
			DBG("GET_FA\n");
			data_len--;
			crc_len=0;
			state=GET_CHECSUM;
		}
		else if(state==GET_CHECSUM)
		{
			if(crc_len!=2)
			{
				crc[crc_len++]=ch;
			}

			if(crc_len==2)
			{
				//verify checksum
				int verify=0xf5+0x8a+0xfa+0x26+longlen;
				rt_kprintf("command is \n");
				for(i=0;i<data_len;i++)
				{
					rt_kprintf("%2x ",ptr[i]);	
					verify+=ptr[i];
				}
				rt_kprintf("crc is %2x %2x,verify is %x\n",crc[0],crc[1],verify);
				if(verify!=(crc[0]<<8|crc[1]))
				{
					rt_device_write(common_dev[dev], 0, (void *)COMMAND_FAIL, strlen(COMMAND_FAIL));
				}
				else
				{
					rt_device_write(common_dev[dev], 0, (void *)COMMAND_OK, strlen(COMMAND_OK));
					set_config(ptr,longlen,dev);
					break;
				}
				state=GET_F5;
			}
		}
		else
		{
			state=GET_F5;
			
			break;
		}
	}
	return ;
}
static bool flag_cnn[4]={false,false,false,false};
void all_cut()
{
	MAP_GPIOPinWrite(GPIO_PORTB_BASE,GPIO_PIN_4,GPIO_PIN_4);	
	MAP_GPIOPinWrite(GPIO_PORTE_BASE,GPIO_PIN_5,0); 
	MAP_GPIOPinWrite(GPIO_PORTK_BASE,GPIO_PIN_2,0); 
	flag_cnn[0]=false;
	flag_cnn[1]=false;
	flag_cnn[2]=false;
	flag_cnn[3]=false;
}
void cnn_out(int index,int level)
{
	
	
	if(phy_link)
	{
		if(level&&(flag_cnn[index]==false))
			flag_cnn[index]=true;
		else if(!level&&(flag_cnn[index]==true))
			flag_cnn[index]=false;
		else
			return;
		rt_kprintf("dev %d , level %d, phy_link %d\n",index,level,phy_link);
		switch(index)
		{
			case 0:
				if(level)
					MAP_GPIOPinWrite(GPIO_PORTB_BASE,GPIO_PIN_4,0);
				else
					MAP_GPIOPinWrite(GPIO_PORTB_BASE,GPIO_PIN_4,GPIO_PIN_4);
				break;
			case 1:
				if(level)
					MAP_GPIOPinWrite(GPIO_PORTE_BASE,GPIO_PIN_5,GPIO_PIN_5);
				else
					MAP_GPIOPinWrite(GPIO_PORTE_BASE,GPIO_PIN_5,0);	
				break;
			case 2:
				if(level)
					MAP_GPIOPinWrite(GPIO_PORTK_BASE,GPIO_PIN_2,GPIO_PIN_2);
				else
					MAP_GPIOPinWrite(GPIO_PORTK_BASE,GPIO_PIN_2,0);	
				break;
			case 3:
				if(level)
				;//	MAP_GPIOPinWrite(GPIO_PORTB_BASE,GPIO_PIN_4,GPIO_PIN_4);
				else
				;//	MAP_GPIOPinWrite(GPIO_PORTB_BASE,GPIO_PIN_4,0);	
				break;
			default:
				break;
		}
	}
	else
	{
		MAP_GPIOPinWrite(GPIO_PORTB_BASE,GPIO_PIN_4,GPIO_PIN_4);	
		MAP_GPIOPinWrite(GPIO_PORTE_BASE,GPIO_PIN_5,0);	
		MAP_GPIOPinWrite(GPIO_PORTK_BASE,GPIO_PIN_2,0);	
		flag_cnn[0]=false;
		flag_cnn[1]=false;
		flag_cnn[2]=false;
		flag_cnn[3]=false;
		//MAP_GPIOPinWrite(GPIO_PORTB_BASE,GPIO_PIN_4,0);	
	}
}
int baud(int type)
{
	switch(type)
	{
		case 0:
			return 115200;
		case 1:
			return 460800;
		case 2:
			return 921600;
		case 3:
			return 1000000;
		case 4:
			return 2000000;
		case 5:
			return 4000000;
		case 6:
			return 6000000;
		}
	return 0;
}
void print_config(config g)
{
	rt_kprintf("\n============================================================================>\n");
	rt_kprintf("local_ip %s\n",g.local_ip);
	rt_kprintf("local_ip6 %s\n",g.local_ip6);
	rt_kprintf("local_port0 %d\n",g.local_port[0]);
	rt_kprintf("local_port1 %d\n",g.local_port[1]);
	rt_kprintf("local_port2 %d\n",g.local_port[2]);
	rt_kprintf("local_port3 %d\n",g.local_port[3]);
	rt_kprintf("sub_msk %s\n",g.sub_msk);
	rt_kprintf("gw %s\n",g.gw);
	rt_kprintf("mac %s\n",g.mac);
	rt_kprintf("remote_ip0 %s\n",g.remote_ip[0]);
	rt_kprintf("remote_ip1 %s\n",g.remote_ip[1]);
	rt_kprintf("remote_ip2 %s\n",g.remote_ip[2]);
	rt_kprintf("remote_ip3 %s\n",g.remote_ip[3]);
	rt_kprintf("remote_ip60 %s\n",g.remote_ip6[0]);
	rt_kprintf("remote_ip61 %s\n",g.remote_ip6[1]);
	rt_kprintf("remote_ip62 %s\n",g.remote_ip6[2]);
	rt_kprintf("remote_ip63 %s\n",g.remote_ip6[3]);
	rt_kprintf("remote_port0 %d\n",g.remote_port[0]);
	rt_kprintf("remote_port1 %d\n",g.remote_port[1]);
	rt_kprintf("remote_port2 %d\n",g.remote_port[2]);
	rt_kprintf("remote_port3 %d\n",g.remote_port[3]);
	rt_kprintf("IP socket0 %s socket1 %s socket2 %s socket3 %s\n",((g.config[0]&0x01)==0)?"IPV4":"IPV6",((g.config[1]&0x01)==0)?"IPV4":"IPV6",((g.config[2]&0x01)==0)?"IPV4":"IPV6",((g.config[3]&0x01)==0)?"IPV4":"IPV6");
	rt_kprintf("protol socket0 %s socket1 %s socket2 %s socket3 %s\n",((g.config[0]&0x02)==0x02)?"TCP":"UDP",((g.config[1]&0x02)==0x02)?"TCP":"UDP",((g.config[2]&0x02)==0x02)?"TCP":"UDP",((g.config[3]&0x02)==0x02)?"TCP":"UDP");
	rt_kprintf("mode socket0 %s socket1 %s socket2 %s socket3 %s\n",((g.config[0]&0x04)==0x04)?"SERVER":"CLIENT",((g.config[1]&0x04)==0x04)?"SERVER":"CLIENT",((g.config[2]&0x04)==0x04)?"SERVER":"CLIENT",((g.config[3]&0x04)==0x04)?"SERVER":"CLIENT");
	rt_kprintf("baud %d.%d.%d.%d\n",baud((g.config[0]&0xf8)>>3),baud((g.config[1]&0xf8)>>3),baud((g.config[2]&0xf8)>>3),baud((g.config[3]&0xf8)>>3));
	rt_kprintf("\n============================================================================>\n");
}
int common_w_socket(int dev)
{	
	int len;
	rt_uint8_t common_buf[1024],*ptr;
	ptr=common_buf;
	len=rt_device_read(common_dev[dev], 0, ptr, 1024);
	if(phy_link&&(len>0))
		rt_data_queue_push(&g_data_queue[dev*2], ptr, len, RT_WAITING_FOREVER);
	return 0;
}
static rt_err_t common_rx_ind(rt_device_t dev, rt_size_t size)
{
    /* release semaphore to let finsh thread rx data */
	//DBG("dev %d common_rx_ind %d\r\n",which_common_dev(common_dev,dev),size);
    rt_sem_release(&(rx_sem[which_common_dev(common_dev,dev)]));
    return RT_EOK;
}

void common_w(void* parameter)
{
	int dev=((int)parameter)/2;
	static int flag=0,need_reconfig=0;
	DBG("common_w %d Enter\r\n",dev);
	while (1)
	{
		/* wait receive */
		if (rt_sem_take(&(rx_sem[dev]), RT_WAITING_FOREVER) != RT_EOK) continue;
		//DBG("to read in_low %d\r\n",ind_low(dev));
		if(ind[dev])
		{	
			//DBG("dev %d in socket data flag %d\n",dev,flag);
			if(flag==1)
			{
				print_config(g_conf);
				flag=0;	
				void *ptr1=(void *)&g_confb;
				void *ptr2=(void *)&g_conf;
				if(rt_memcmp(ptr1,ptr2,sizeof(config))!=0)
				{
					print_config(g_conf);
				}
			}
			
