blueskycoco/rtt/bsp/tm4c129x/applications/con_common.c
			/*socket data transfer,use dma*/
			common_w_socket(dev);
		}
		else
		{
			DBG("dev %d in config data flag %d\n",dev,flag);
			if(flag==0)
			{
				flag=1;
				void *ptr1=(void *)&g_confb;
				void *ptr2=(void *)&g_conf;
				rt_memcpy(ptr1,ptr2,sizeof(config));
			}
			common_rw_config(dev);
			
		}
	}
}
static void common_r(void* parameter)
{
    rt_size_t data_size;
    const void *last_data_ptr;
	int dev=(int)parameter;
	while(1)
	{
		rt_data_queue_pop(&g_data_queue[dev], &last_data_ptr, &data_size, RT_WAITING_FOREVER);
		if(data_size!=0 && last_data_ptr)
		{		
			if(dev==1)
				rt_device_write(common_dev[(dev-1)/2], 0, last_data_ptr, data_size);
			else
				rt_data_queue_push(&g_data_queue[dev-1], last_data_ptr, data_size, RT_WAITING_FOREVER);
		}
	}
}

/*init common1,2,3,4 for 4 socket*/
int common_init(int dev)//0 uart , 1 parallel bus, 2 usb
{
	/*init common device*/
	rt_err_t result;
	rt_uint8_t common[10];
	int i;
	/*read config data from internal flash*/
	MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOE);
	MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOK);
	MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOD);
	MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOB);

	MAP_SysCtlDelay(1);
	//config select
	MAP_GPIOIntDisable(GPIO_PORTD_BASE, GPIO_PIN_2);
	MAP_GPIOPinTypeGPIOInput(GPIO_PORTD_BASE, GPIO_PIN_2);//ind0
	MAP_GPIOIntTypeSet(GPIO_PORTD_BASE, GPIO_PIN_2, GPIO_BOTH_EDGES);
	MAP_IntEnable(INT_GPIOD);
	MAP_GPIOIntEnable(GPIO_PORTD_BASE, GPIO_PIN_2);
	int ui32Status = MAP_GPIOIntStatus(GPIO_PORTD_BASE, true);
	MAP_GPIOIntClear(GPIO_PORTD_BASE, ui32Status);
	//connect ind
	MAP_GPIOPinTypeGPIOOutput(GPIO_PORTE_BASE, GPIO_PIN_5);//CNN1
	MAP_GPIOPinTypeGPIOOutput(GPIO_PORTK_BASE, GPIO_PIN_2);//CNN2
	MAP_GPIOPinTypeGPIOOutput(GPIO_PORTK_BASE, GPIO_PIN_3);//CNN3
	MAP_GPIOPinTypeGPIOOutput(GPIO_PORTB_BASE, GPIO_PIN_4);//CNN4
	MAP_GPIOPinWrite(GPIO_PORTB_BASE,GPIO_PIN_4,GPIO_PIN_4);	
	MAP_GPIOPinWrite(GPIO_PORTE_BASE,GPIO_PIN_5,0);	
	MAP_GPIOPinWrite(GPIO_PORTK_BASE,GPIO_PIN_2,0);	
	default_config();

	for(i=3;i<67;i++)
	{
		config_socket0_ip6[i]=0xff;
		config_socket1_ip6[i]=0xff;
		config_socket2_ip6[i]=0xff;
		config_socket3_ip6[i]=0xff;
		config_local_ip6[i]=0xff;
	}
	config_socket0_ip6[67]=0x26;
	config_socket1_ip6[67]=0x26;
	config_socket2_ip6[67]=0x26;
	config_socket3_ip6[67]=0x26;
	config_local_ip6[67]=0x26;
	config_socket0_ip6[68]=0xfa;
	config_socket1_ip6[68]=0xfa;
	config_socket2_ip6[68]=0xfa;
	config_socket3_ip6[68]=0xfa;
	config_local_ip6[68]=0xfa;
	for(i=0;i<4;i++)
	{
		//config sem
		rt_sprintf(common,"common_%d_rx",i);
		rt_sem_init(&(rx_sem[i]), common, 0, 0);
		if(dev==DEV_UART)
		{
			if(i==1)
				rt_sprintf(common,"uart%d",4);
			else
				rt_sprintf(common,"uart%d",i);
		}
		else if(dev==DEV_BUS)
		{

		}
		else
		{

		}
		DBG("To open ==>%s\n",common);
		//open uart ,parallel ,usb
		common_dev[i] = rt_device_find(common);
		if (common_dev[i] == RT_NULL)
		{
			DBG("app_common: can not find device: %s\n",common);
			return 0;
		}
		if (rt_device_open(common_dev[i], RT_DEVICE_OFLAG_RDWR | RT_DEVICE_FLAG_INT_RX) == RT_EOK)
		{
			//create common_w,r thread to read data from socket write to uart,parallel,usb
			//or read from uart,parallel,usb write to socket
			rt_sprintf(common,"common_wx%d",i);
			tid_common_w[i] = rt_thread_create(common,common_w, (void *)(i*2),2048, 20, 10);
			rt_sprintf(common,"common_rx%d",i);
			tid_common_r[i] = rt_thread_create(common,common_r, (void *)(i*2+1),2048, 20, 10);

			rt_device_set_rx_indicate(common_dev[i], common_rx_ind);

			if(tid_common_w[i]!=RT_NULL)
				rt_thread_startup(tid_common_w[i]);			
			if(tid_common_r[i]!=RT_NULL)
				rt_thread_startup(tid_common_r[i]);
		}
	}
	//list_mem1();	
	for(i=0;i<4;i++)
		socket_thread_start(i);
	//rt_thread_delay(100);
	//list_mem1();	
	//list_tcps1();
	//list_thread();
	
	DBG("common_init ok\n");
	//list_mem1();	
	return 1;
}
#endif
